#### PolylineSegments Members

---

|  |
| --- |
| PolylineSegments Class   Methods   Properties   See Also |

The  PolylineSegments  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PolylineSegments |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetVertices | Returns an array of vertices of the polyline segments. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndLocalParameter | Local parameter associated with the end point. |
| Public property | EndParameter | Parameter associated with the end point. |
| Public property | IsFilled | Indicates whether the area enclosed by the polyline is to be filled or not. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LineProperties | Access to the line (pen) properties of the polyline |
| Public property | StartLocalParameter | Local parameter associated with the start point. |
| Public property | StartParameter | Parameter associated with the start point. |

# See Also

PolylineSegments Class

Autodesk.Revit.DB Namespace